# Assignment #6 - Data Gathering and Warehousing - DSSA-5102

Instructor: Melissa Laurino</br>
Spring 2025</br>

Name: Joe D'Agostino
</br>
Date: 3/8/25
<br>
<br>
**At this time in the semester:** <br>
- We have explored a dataset. <br>
- We have cleaned our dataset. <br>
- We created a Github account with a repository for this class and included a metadata read me file about our data. <br>
- We introduced general SQL syntax, queries, and applications in Python.<br>
<br>
Now we will start the process of uploading our dataset into a database. There are many different ways to upload your .csv data into a database (.db file). Databases can be created in many open source applications, MySQL workbench, and even some websites can load your .csv data into a database...for a small fee. Instead of using an application, we are going to first create our database for our dataset from scratch in Python. On a much larger scale, data may be automatically uploaded to a database once it is aquired.<br>

#### Assignment #6 Objectives

We will use the Python packages SQL Alchemy and SQLite to create three separate databases for practice. 
- Create one database on our MySQL server (10)
  - Create and populate our first table with appropriate data types
  - View the MySQL workbench schema to see the table you created
- Create one test database locally that we can still use with MySQL (3)
- Create one test database locally as a .db file. (2) <br>
<br>
Follow the instructions below to complete the assignment. For submission, please include your .ipynb file with output cells (Or a link to Github), and the screen shot of your first database table in MySQL Workbench. Answer any questions in markdown cell boxes. Be sure to comment all code in your own words.

### Creating our database from scratch to integrate with MySQL Workbench in Python<br>

**BEFORE YOU BEGIN!**<br>
Is your MySQL Server running on your local machine?<br>
**Start the server** if it is not running already.

We need the MySQL connector to work with Python since we are using SQLAlchemy with MySQL Workbench. Let's install the MySQL driver. Run the following code in a terminal window to install the MySQL connector: <br>
pip install mysql-connector-python mysql-connector

#### Creating a database from scratch in Python using SQL Alchemy<br>
Additional sources: <br>
-- https://medium.com/@sandyjtech/creating-a-database-using-python-and-sqlalchemy-422b7ba39d7e <br>
-- https://www.youtube.com/watch?v=xr7vDSFXjW0 <br>
-- https://www.geeksforgeeks.org/how-to-design-a-database-for-spotify/ (My specific inspiration for understanding a Spotify schema)

In [1]:
# Load necessary packages:
from sqlalchemy import create_engine, Column, String, Integer, Boolean, BigInteger, Float, text # Database navigation
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import sessionmaker
from sqlalchemy import insert
import mysql.connector
import sqlite3 # A second option for working with databases
import pandas as pd # Python data manilpulation

Open MySQL Workbench.
- Click on Local Instance (This is your port number - if needed)

In [2]:
# Connect to the MySQL server 
# Define our variables. We set these during our first class in our technology set up. 
# If you are unsure of these variables, do not guess. 
# Visit MySQL Workbench for the localport number, host and user.

conn = mysql.connector.connect(
        host="localhost", # This is your local instance number when you open MySQL Workbench.
        user="root", # This is your username for MySQL Workbench
        password="karateChop") # We wrote this password down in our first class!

# In order to connect to the server, we must include all of the above.

cursor = conn.cursor()

# CREATE DATABASE (SQL command) if it does not already exist
cursor.execute("CREATE DATABASE IF NOT EXISTS usa_olympic_athletes")
# usa_olympic_athletes will be the name when the database is created.

print("Database created successfully in MySQL Workbench! Go check it out.")

Database created successfully in MySQL Workbench! Go check it out.

**STOP**<br><br>
Confirm your database was created before continuing. <br> <br>
Open MySQL Workbench.<br>
Under MySQL Connections, click Local Instance<br>
Click the Schemas tab<br>
**You should now see a new (empty) database that you created**<br>
If it does not show up right away, hit refresh (The circular arrows)

In [3]:
# Time to connect to the database using SQL Alchemy:
DATABASE_URL = "mysql+mysqlconnector://root:karateChop@localhost/usa_olympic_athletes" # Use MySQL Connector to connect to the database
engine = create_engine(DATABASE_URL) # Creates a connection to the MySQL database

print("Connected to MySQL database successfully!")

Connected to MySQL database successfully!

In [4]:
# Read in the CLEAN .csv file (Using pandas) we will use to populate our database. This is the same dataset that you cleaned for Assignment #2!
usa_olympic_athletes_df = pd.read_csv('data/usa_olympic_data.csv') # load the USA Olympic Athlete data

In [5]:
# Preview the dataframe by looking at the first five rows.
usa_olympic_athletes_df.head()

,id,name,sex,age,height,weight,team,games,year,season,city,sport,event,medal
0,6,Per Knut Aaland,M,31.0,188.0,75.0,United States,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 10 kilometres,NaN
1,6,Per Knut Aaland,M,31.0,188.0,75.0,United States,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 50 kilometres,NaN
2,6,Per Knut Aaland,M,31.0,188.0,75.0,United States,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 10/15 kilometres Pu...,NaN
3,6,Per Knut Aaland,M,31.0,188.0,75.0,United States,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 4 x 10 kilometres R...,NaN
4,6,Per Knut Aaland,M,33.0,188.0,75.0,United States,1994 Winter,1994,Winter,Lillehammer,Cross Country Skiing,Cross Country Skiing Men's 10 kilometres,NaN

In [6]:
# What are all of the column names and data types for our dataset? 
# It is important to know the column names from the .csv because these are the field names we will want to use for our first table.
# Remember, the field names represent the column names of the csv/table.
usa_olympic_athletes_df.dtypes

id          int64
name       object
sex        object
age       float64
height    float64
weight    float64
team       object
games      object
year        int64
season     object
city       object
sport      object
event      object
medal      object
dtype: object

If you are an experienced Python user, you can create a base Python class for all of our tables before populating them and use built in SQLAlchemy features. <br>
To practice SQL, we will create our database from scratch using SQL commands in Python instead.

We can use a new SQL statement CREATE TABLE to create our first table in our new database by writing a query.<br>
Everyone's data is different! Choose the SQL data types that fit YOUR data needs!<br>
SQL Data Types: https://www.w3schools.com/sql/sql_datatypes.asp

In [7]:
# Create our first table in the database file using SQL statements:
# We want our table column names to match what is in the .csv file
first_table_query = """CREATE TABLE IF NOT EXISTS athlete (
                            athlete_id INT AUTO_INCREMENT PRIMARY KEY,
                            name VARCHAR(100),
                            sex CHAR(1),
                            age FLOAT(4,1),
                            height FLOAT(4,1),
                            weight FLOAT(4,1),
                            team VARCHAR(255),
                            year INT(4),
                            season VARCHAR(10),
                            city VARCHAR(100),
                            sport VARCHAR(255),
                            event VARCHAR(255),
                            medal SET('Gold', 'Silver', 'Bronze', '0')
                    );"""
# Note that the primary key for this table is a column/field "athlete_id"
# This is not a field that existed previously. AUTO_INCREMENT automatically generates a unique value for each new row added to the table. 
# Each new value is one greater than the previous value. We cannot make the Date column/field our primary key, because it is not unique.

In [8]:
#Execute the query:
with engine.connect() as connection:
    connection.execute(text(first_table_query))

print("First table created successfully!")

First table created successfully!

Define your SQL data types for your first table: <br><br>
**My SQL data types for my first table, athletes:**<br>
- VARCHAR(100) - a variable length string. I have some with a length of 20, 100 and 255
- CHAR(1) - a fixed length string. This is always just one character.
- FLOAT(4,1) - a floating point number including 1 decimal digit.
- INT(4) - a medium integer with a length of 4
- SET - a string object chosen from a list of: 'Gold', 'Silver', 'Bronze', 'NA'

Why did you choose these values to make up your first database table? What did you choose for your primary key and why?<br><br>
I created a new field athlete_id as my primary key. The previous data did have an id column that was a unique integer, but when I looked through the data I'm pretty sure I saw some repeat values, so to be safe I created a new id column in the table as the primary key.<br><br>
As far as the other values, I got a pen and paper and wrote the columns out and went on a case by case basis as to the best value fit. Most are VARCHAR and INTEGER, but I did decide to go with CHAR(1) for sex as that is either M or F, but what if there's a new designation in the future Olympics? I thought that gave me a bit of flexibility with the data going forward. For medal I decided to go with SET since there's only 4 values in that column (Gold, Silver, Bronze, NA). I haven't used SET in the past so I wanted to try a value I'm not familiar with.<br><br>
This one puzzled me for a while, but a YEAR cannot be before 1901, and the Olympics are older than that. So I'm using an INTEGER to store the year value. This one really had me for a while!

In [9]:
# I have some NaN values in my dataset, converting them to 0's
usa_olympic_athletes_df['age'].fillna(0, inplace=True)
usa_olympic_athletes_df['height'].fillna(0, inplace=True)
usa_olympic_athletes_df['weight'].fillna(0, inplace=True)
usa_olympic_athletes_df['year'].fillna(1000, inplace=True)
usa_olympic_athletes_df['medal'].fillna(0, inplace=True)

/var/folders/tn/cf396_tn26g112g5gtc87pqm0000gn/T/ipykernel_8164/670196957.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  usa_olympic_athletes_df['age'].fillna(0, inplace=True)
/var/folders/tn/cf396_tn26g112g5gtc87pqm0000gn/T/ipykernel_8164/670196957.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  usa_olympic_athletes_df['height'].fillna(0, inplace=True)
/var/folders/tn/cf396_tn26g112g5gtc87pqm0000gn/T/ipykernel_8164/670196957.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  usa_olympic_athletes_df['weight'].fillna(0, inplace=True)
/var/folders/tn/cf396_tn26g112g5gtc87pqm0000gn/T/ipykernel_8164/670196957.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  usa_olympic_athletes_df['year'].fillna(1000, inplace=True)
/var/folders/tn/cf396_tn26g112g5gtc87pqm0000gn/T/ipykernel_8164/670196957.py:6: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  usa_olympic_athletes_df['medal'].fillna(0, inplace=True)

In [10]:
# Check for NaN values in the dataframe
print(usa_olympic_athletes_df.isna().sum())

id        0
name      0
sex       0
age       0
height    0
weight    0
team      0
games     0
year      0
season    0
city      0
sport     0
event     0
medal     0
dtype: int64

In [110]:
#output all the unique year values to see if there's something wrong in the data
usa_olympic_athletes_df['year'].unique()
usa_olympic_athletes_df['medal'].unique()

array([nan, 'Silver', 'Bronze', 'Gold'], dtype=object)

In [16]:
# There are multiple ways to populate the fields of the table. 
# Another option is to add a subset of the data into data table, and then populate the database table.
# Please feel free to change or alter the code below.
# This example uses the MySQL connector:

with engine.connect() as connection:
    # Make sure MySQL is using the correct database
    cursor.execute("USE usa_olympic_athletes;")

    # Populate the  table
    for _, row in usa_olympic_athletes_df.iterrows():
        cursor.execute("""INSERT INTO athlete (name, sex, age, height, weight, team, year, season, city, sport, event, medal)
                          VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
                       """, [row['name'],
                            row['sex'],
                            row['age'],
                            row['height'],
                            row['weight'],
                            row['team'],
                            row['year'],
                            row['season'],
                            row['city'],
                            row['sport'],
                            row['event'],
                            row['medal']
                            ])
    
    conn.commit()

In [91]:
# There are multiple ways to populate the fields of the table. 
# Another option is to add a subset of the data into data table, and then populate the database table.
# Please feel free to change or alter the code below.
# This example uses the MySQL connector:

with engine.connect() as connection:
    # Make sure MySQL is using the correct database
    cursor.execute("USE usa_olympic_athletes;")

    # Populate the  table
    for _, row in usa_olympic_athletes_df.iterrows():
        cursor.execute("""INSERT INTO athlete (name, sex, age, height, weight, team, year, season, city, sport, event, medal)
                          VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
                       """, (row['name'],
                             row['sex'],
                             row['age'],
                             row['height'],
                             row['weight'],
                             row['team'],
                             row['year'],
                             row['season'],
                             row['city'],
                             row['sport'],
                             row['event'],
                             row['medal']
                            ))
    
    conn.commit()

ProgrammingError: 1054 (42S22): Unknown column 'nan' in 'field list'

**STOP**<br><br>
In MySQL Workbench, you should see your new table that you have created and populated.<br>
You can now run a SQL query directly in MySQL Workbench!<br>
You can also run a query below to test it:

In [17]:
# Now that we have populated our table, let's try out a query.

with engine.connect() as connection:  # Establish a connection
    practice_query = text("""SELECT * 
                             FROM athlete
                             WHERE medal = 'Gold'
                                 """) # Define the query - text() ensures that the query string is read as a SQL expression 
    practice_query = pd.read_sql(practice_query, connection) #Use pandas to read the sql query with the connection to the database
    
# Print the results
practice_query

,athlete_id,name,sex,age,height,weight,team,year,season,city,sport,event,medal
0,23,Margaret Ives Abbott (-Dunne),F,23.0,0.0,0.0,United States,1900,Summer,Paris,Golf,Golf Women's Individual,{Gold}
1,32,Julius Shareef Abdur-Rahim,M,23.0,202.0,104.0,United States,2000,Summer,Sydney,Basketball,Basketball Men's Basketball,{Gold}
2,35,"Louis Grenville ""Lou"" Abell",M,15.0,0.0,0.0,Vesper Boat Club,1900,Summer,Paris,Rowing,Rowing Men's Coxed Eights,{Gold}
3,36,"Louis Grenville ""Lou"" Abell",M,19.0,0.0,0.0,Vesper Boat Club,1904,Summer,St. Louis,Rowing,Rowing Men's Coxed Eights,{Gold}
4,37,Michael Brent Abernathy,M,22.0,182.0,84.0,United States,2000,Summer,Sydney,Baseball,Baseball Men's Baseball,{Gold}
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2633,18481,"Timothy R. ""Tim"" Young",M,26.0,172.0,77.0,United States,2000,Summer,Sydney,Baseball,Baseball Men's Baseball,{Gold}
2634,18513,Mariel Leigh Zagunis,F,19.0,173.0,72.0,United States,2004,Summer,Athina,Fencing,"Fencing Women's Sabre, Individual",{Gold}
2635,18514,Mariel Leigh Zagunis,F,23.0,173.0,72.0,United States,2008,Summer,Beijing,Fencing,"Fencing Women's Sabre, Individual",{Gold}
2636,18572,Rbert Zimonyi,M,46.0,170.0,52.0,United States,1964,Summer,Tokyo,Rowing,Rowing Men's Coxed Eights,{Gold}
2637,18589,"Zachary ""Zac"" Zorn",M,21.0,193.0,86.0,United States,1968,Summer,Mexico City,Swimming,Swimming Men's 4 x 100 metres Freestyle Relay,{Gold}

**STOP**<br>
To create a new schema diagram for your new database (Even though it only has one table...it's good practice!)<br>
Open MySQL Workbench again<br>
Click Home<br>
Click the Models icon<br>
Click the > icon to the right of "Models"<br>
Choose “Create EER Model from Database” <br>
The Reverse Engineer Database Wizard starts and will walk you through your first database schema diagram.<br>
Save your model. <br>
You can now add relationships and or modify tables...but for this assignment, all we need is that first table. <br>

**Add a screen shot of your first schema diagram (The table) to your repository/Blackboard subission.**

In [ ]:
#Close the database connection :)
cursor.close()
conn.close()

### Creating a local database from scratch

#### Creating a local database from scratch in Python using SQL Alchemy for MySQL Workbench:<br>
Another example: https://blog.sqlitecloud.io/sqlite-python-sqlalchemy

In [18]:
# BEFORE YOU BEGIN!
# Is your MySQL Server running on your local machine?
# Doesn't matter this time, please continue! :)
from sqlalchemy import create_engine

In [19]:
engine = create_engine("sqlite:///local_test.db")  # Creates a local database file in the SAME directory as this document.

In [20]:
# The only database connection parameters we need here are the name of the database we just created locally
# NOTE: We are not using the local host, but can still connect our database to MySQL
DATABASE_URL = "mysql+mysqlconnector://root:karateChop@127.0.0.1/local_test.db"

In [22]:
cursor.execute("CREATE DATABASE IF NOT EXISTS usa_olympic_athletes_local")

In [ ]:
# Close your connection :)
conn.close()

**STOP HERE**<br>
Before moving on, it is **important** to understand the difference of what we have just completed. Using SQL Alchemy, we have created a database LOCALLY. Notice we did not specify a specific host, BUT we did specify a user and password! This means we can access this database locally in MySQL Workbench if we choose.

#### Creating a local database (.db file) from scratch in Python using SQLite:<br>

In [ ]:
# Load necessary packages:
from sqlalchemy import create_engine, inspect, text # Database navigation
import sqlite3 # A second option for working with databases
import pandas as pd # Python data manilpulation

In [ ]:
# Load the .csv subset again if you need to if you are starting over 


# Create a SQLite database and engine
db_file = "X.db"
engine = create_engine(f"sqlite:///{db_file}")

# Store the dataframe in the database as a single table for quick practice (Never recommended, especially for large data sets) 
df.to_sql("X", con=engine, if_exists="replace", index=False)

**STOP HERE**<br>
This method creates a database as a file on our local machine. The .db file is created in the same location or working directory you are currently in (Go check!). If you did not specify a working directory, the .db file is created where this .ipynb is located.

In [ ]:
#Close the database connection :)
conn.close()